muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Pipeline_FaceRecognition/facerecognition_imp.c
// Facerecognition postprocess / FR thread
//
// Adds deep diagnostics to find accuracy regressions:
//  - Detects FR input quantization mismatch (U8 vs I8).
//  - Prints FR input stats (global + per-channel), ROI/crop/margin details,
//    and % of bilinear taps that were clamped to image borders.
//  - Prints FR output stats (int8 min/max/mean, dequant L2 norm, NaN check).
//  - Audits reference set at startup and prints Top-K matches per frame.
//  - Tracks embedding self-consistency over time.
//
// Build-time knobs (override with -D):
//   FR_INPUT_IS_U8=0/1  (0 = INT8 symmetric input; 1 = U8 zp=128 input)
//   FR_TOPK=3
//   FR_CROP_MARGIN=0.20f
//   FR_MATCH_THR=0.50f
//   FR_PERIOD_MS=250
//
// If you see [FR][in] I8 stats mean ≪ 0 (e.g., ~-90), your network likely expects U8 input.
// Rebuild with:  -DFR_INPUT_IS_U8=1
//
// NOTE: FR output is still INT8 (scale≈1/128, zp=0). That part stays unchanged.


#undef  FR_INPUT_IS_U8
#define FR_INPUT_IS_U8 1
#pragma message("FORCING FR_INPUT_IS_U8=1 (local override)")




#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stddef.h>
#include <math.h>
#include <assert.h>

/* STM32 / RTOS */
#include "stm32n6xx_hal.h"
#include "FreeRTOS.h"
#include "semphr.h"

/* App & runtime */
#include "app_config.h"               // POSTPROCESS_TYPE, etc.
#include "network.h"                  // NN_* macros (NN_OUT_NB, NN_WIDTH/HEIGHT, etc.)
#include "cache_utils.h"              // DCACHE_* helpers
#include "npu_guard.h"                // NPU_Lock / TAG_FR
#include "ll_aton_runtime.h"          // LL_Buffer_*, HAL bindings
#include "app_shared.h"               // display_t, bqueue_t, od types (via postproc), prototypes
#include "app_postprocess.h"          // od_pp_out_t / od_pp_outBuffer_t, app_postprocess_*()
#include "fr_helpers.h"               // helpers (frame snapshot, etc.)
#include "face_recognition.h"         // FR_IN_W/H, FR_EMB_SIZE, fr_* APIs
#include "facerecognition_imp.h"      // pp_thread_fct declaration

#ifndef MIN
#define MIN(a,b) (( (a) < (b) ) ? (a) : (b))
#endif

/* ====== Build-time knobs (override via -D at compile) ====== */
#ifndef FR_INPUT_IS_U8
#define FR_INPUT_IS_U8  0    /* 0 = I8 symmetric input; 1 = U8 zp=128 input */
#endif

#ifndef FR_TOPK
#define FR_TOPK  3
#endif

#ifndef FR_CROP_MARGIN
#define FR_CROP_MARGIN  0.20f
#endif

#ifndef FR_MATCH_THR
#define FR_MATCH_THR    0.50f
#endif

#ifndef FR_PERIOD_MS
#define FR_PERIOD_MS    250U
#endif

#ifndef FR_ACCEPT_CONF_MIN
#define FR_ACCEPT_CONF_MIN   0.70f
#endif
#ifndef FR_ACCEPT_SIDE_MIN
#define FR_ACCEPT_SIDE_MIN   0.28f
#endif
#ifndef FR_CENTER_TOL
#define FR_CENTER_TOL        0.60f
#endif
#ifndef FR_SCORE_SIDE_REF
#define FR_SCORE_SIDE_REF    0.35f
#endif
#ifndef FR_STABLE_IOU_MIN
#define FR_STABLE_IOU_MIN    0.30f
#endif
#ifndef FR_HOLD_MISS_FRAMES
#define FR_HOLD_MISS_FRAMES  6
#endif
#ifndef FR_EMA_ALPHA
#define FR_EMA_ALPHA         0.70f
#endif

/* Debug cadence (ms) for verbose prints */
#ifndef DBG_EVERY_MS
#define DBG_EVERY_MS  2000U
#endif

/* Reference set quick audit prints */
#ifndef DBG_AUDIT_REFSET
#define DBG_AUDIT_REFSET  1
#endif

/* Additional per-frame prints (set to 0 to reduce noise) */
#ifndef DBG_PRINT_TOPK
#define DBG_PRINT_TOPK  1
#endif
#ifndef DBG_PRINT_IN_STATS
#define DBG_PRINT_IN_STATS  1
#endif
#ifndef DBG_PRINT_OUT_STATS
#define DBG_PRINT_OUT_STATS 1
#endif
#ifndef DBG_PRINT_ROI
#define DBG_PRINT_ROI  1
#endif

/* Prototypes provided elsewhere */
const LL_Buffer_InfoTypeDef *Detector_In_Info(void);
const LL_Buffer_InfoTypeDef *Detector_Out_Info(void);
void FaceRec_Run_NoLock(void);

/* Globals defined in app.c that we use here */
extern bqueue_t nn_output_queue;
extern display_t disp;
extern volatile char g_fr_overlay_label[32];

/* ---- Reference set compiled in Generated/embeddings_table.c ---- */
typedef struct { const char* name; const float* data; int dim; } EmbRec;
extern const EmbRec g_ref_set[];
extern const int    g_ref_set_count;

/* ---------------- helpers ---------------- */

static inline int clampi(int v, int lo, int hi){ return (v<lo)?lo:((v>hi)?hi:v); }

static float cosine_sim(const float *a, const float *b, int n)
{
  /* robust FP accumulation */
  double ab = 0.0, aa = 0.0, bb = 0.0;
  for (int i = 0; i < n; ++i) {
    double x = a[i], y = b[i];
    ab += x * y;  aa += x * x;  bb += y * y;
  }
  if (aa <= 0.0 || bb <= 0.0) return 0.0f;
  double d = ab / (sqrt(aa) * sqrt(bb));
  if (d >  1.0) d =  1.0;
  if (d < -1.0) d = -1.0;
  return (float)d;
}

static inline float iou_norm_boxes(const od_pp_outBuffer_t *a, const od_pp_outBuffer_t *b)
{
  float ax0 = a->x_center - a->width*0.5f,  ay0 = a->y_center - a->height*0.5f;
  float ax1 = a->x_center + a->width*0.5f,  ay1 = a->y_center + a->height*0.5f;
  float bx0 = b->x_center - b->width*0.5f,  by0 = b->y_center - b->height*0.5f;
  float bx1 = b->x_center + b->width*0.5f,  by1 = b->y_center + b->height*0.5f;
  float ix0 = fmaxf(ax0, bx0), iy0 = fmaxf(ay0, by0);
  float ix1 = fminf(ax1, bx1), iy1 = fminf(ay1, by1);
  float iw = fmaxf(0.f, ix1 - ix0), ih = fmaxf(0.f, iy1 - iy0);
  float inter = iw * ih;
  float aarea = fmaxf(0.f, ax1-ax0) * fmaxf(0.f, ay1-ay0);
  float barea = fmaxf(0.f, bx1-bx0) * fmaxf(0.f, by1-by0);
  float uni = aarea + barea - inter + 1e-6f;
  return inter / uni;
}

/* Debug metrics for cropping */
typedef struct {
  float x0, y0, x1, y1;     /* crop window in pixels */
  float side, roi_w, roi_h; /* side after margin, raw roi dims */
  int   taps, taps_clamped; /* how many bilinear taps hit image border */
  float mean_r, mean_g, mean_b; /* pre-quant means in [0..1] */
} CropDbg;

/* Crop detector float32 frame (RGB, NHWC, [0..1]) using ROI
 * → FaceRec 160×160 quantized input (INT8 sym or U8 asym), with margin.
 */
static void crop_to_facerec_input_quant_from_detector_f32(
    const float *src_nhwc,  int src_w, int src_h,
    const od_pp_outBuffer_t *roi,
    float margin,           /* e.g. 0.20f = +20% */
#if FR_INPUT_IS_U8
    uint8_t *dst,
#else
    int8_t  *dst,
#endif
    int dst_w, int dst_h,
    CropDbg *dbg /* optional */)
{
  /* square crop with configurable margin */
  const float cx = roi->x_center * (float)src_w;
  const float cy = roi->y_center * (float)src_h;
  const float bw = roi->width  * (float)src_w;
  const float bh = roi->height * (float)src_h;
  const float side0 = fmaxf(bw, bh);
  const float side  = side0 * (1.0f + margin);
  const float x0 = cx - side * 0.5f;
  const float y0 = cy - side * 0.5f;
  const float x1 = cx + side * 0.5f;
  const float y1 = cy + side * 0.5f;

  const float sx_scale = (x1 - x0) / (float)dst_w;
  const float sy_scale = (y1 - y0) / (float)dst_h;

