muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Pipeline_FaceRecognition/facerecognition_imp.c
#if FR_INPUT_IS_U8
  /* U8 asymmetric: [-1,1] → round(x*(255/2) + 128) = round(x*127.5 + 128) */
  const float q_mul = 127.5f;
  const float q_zp  = 128.0f;
#else
  /* INT8 symmetric: [-1,1] → round(x*127) (clamp to [-128,127]) */
  const float q_mul = 127.0f;
#endif

#if !FR_INPUT_IS_U8
  int8_t *dst_i8 = dst;
#else
  uint8_t *dst_u8 = dst;
#endif

  int taps = 0, clamped = 0;
  double acc_r = 0.0, acc_g = 0.0, acc_b = 0.0;

  for (int y = 0; y < dst_h; ++y) {
    float sy = y0 + (y + 0.5f) * sy_scale;
    int sy0 = (int)floorf(sy);
    int sy1 = sy0 + 1;
    float wy = sy - (float)sy0;
    int csy0 = sy0, csy1 = sy1;
    if (csy0 < 0) csy0 = 0; else if (csy0 >= src_h) csy0 = src_h - 1;
    if (csy1 < 0) csy1 = 0; else if (csy1 >= src_h) csy1 = src_h - 1;
    int y_clamp = (csy0 != sy0) || (csy1 != sy1);

    for (int x = 0; x < dst_w; ++x) {
      float sx = x0 + (x + 0.5f) * sx_scale;
      int sx0 = (int)floorf(sx);
      int sx1 = sx0 + 1;
      float wx = sx - (float)sx0;

      int csx0 = sx0, csx1 = sx1;
      if (csx0 < 0) csx0 = 0; else if (csx0 >= src_w) csx0 = src_w - 1;
      if (csx1 < 0) csx1 = 0; else if (csx1 >= src_w) csx1 = src_w - 1;
      int x_clamp = (csx0 != sx0) || (csx1 != sx1);

      const int idx00 = (csy0 * src_w + csx0) * 3;
      const int idx01 = (csy0 * src_w + csx1) * 3;
      const int idx10 = (csy1 * src_w + csx0) * 3;
      const int idx11 = (csy1 * src_w + csx1) * 3;

      const float w00 = (1.0f - wx) * (1.0f - wy);
      const float w01 = (       wx) * (1.0f - wy);
      const float w10 = (1.0f - wx) * (       wy);
      const float w11 = (       wx) * (       wy);

      /* bilinear in RGB, input is [0..1] */
      float r = src_nhwc[idx00+0]*w00 + src_nhwc[idx01+0]*w01 +
                src_nhwc[idx10+0]*w10 + src_nhwc[idx11+0]*w11;
      float g = src_nhwc[idx00+1]*w00 + src_nhwc[idx01+1]*w01 +
                src_nhwc[idx10+1]*w10 + src_nhwc[idx11+1]*w11;
      float b = src_nhwc[idx00+2]*w00 + src_nhwc[idx01+2]*w01 +
                src_nhwc[idx10+2]*w10 + src_nhwc[idx11+2]*w11;

      acc_r += r; acc_g += g; acc_b += b;
      taps++; if (x_clamp || y_clamp) clamped++;

      /* map [0..1] → [-1,1] */
      float rq = r * 2.0f - 1.0f;
      float gq = g * 2.0f - 1.0f;
      float bq = b * 2.0f - 1.0f;

      const int d = (y * dst_w + x) * 3;

#if FR_INPUT_IS_U8
      int qr = (int)lrintf(rq * q_mul + q_zp);
      int qg = (int)lrintf(gq * q_mul + q_zp);
      int qb = (int)lrintf(bq * q_mul + q_zp);
      if (qr < 0) qr = 0; else if (qr > 255) qr = 255;
      if (qg < 0) qg = 0; else if (qg > 255) qg = 255;
      if (qb < 0) qb = 0; else if (qb > 255) qb = 255;
      dst_u8[d+0] = (uint8_t)qr;
      dst_u8[d+1] = (uint8_t)qg;
      dst_u8[d+2] = (uint8_t)qb;
#else
      int qr = (int)lrintf(rq * q_mul);
      int qg = (int)lrintf(gq * q_mul);
      int qb = (int)lrintf(bq * q_mul);
      if (qr < -128) qr = -128; else if (qr > 127) qr = 127;
      if (qg < -128) qg = -128; else if (qg > 127) qg = 127;
      if (qb < -128) qb = -128; else if (qb > 127) qb = 127;
      dst_i8[d+0] = (int8_t)qr;
      dst_i8[d+1] = (int8_t)qg;
      dst_i8[d+2] = (int8_t)qb;
#endif
    }
  }

  if (dbg) {
    dbg->x0 = x0; dbg->y0 = y0; dbg->x1 = x1; dbg->y1 = y1;
    dbg->side = side; dbg->roi_w = bw; dbg->roi_h = bh;
    dbg->taps = taps; dbg->taps_clamped = clamped;
    double denom = (double)(dst_w * dst_h);
    dbg->mean_r = (float)(acc_r / denom);
    dbg->mean_g = (float)(acc_g / denom);
    dbg->mean_b = (float)(acc_b / denom);
  }
}

/* Quick utility */
static float l2_norm(const float *x, int n)
{
  double s=0.0; for (int i=0;i<n;i++){ double v=x[i]; s+=v*v; }
  return (float)sqrt(s);
}

void pp_thread_fct(void *arg)
{
#if POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V2_UF
  yolov2_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V5_UU
  yolov5_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UF || POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UI
  yolov8_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
  /* BlazeFace: no static params */
#else
# error "PostProcessing type not supported"
#endif

  const LL_Buffer_InfoTypeDef *nn_out_info = Detector_Out_Info();

  /* Log detector outputs layout once (sanity check) */
  {
    for (int i = 0; i < NN_OUT_NB; ++i) {
      const char *nm = nn_out_info[i].name ? nn_out_info[i].name : "(null)";
      unsigned long blen = (unsigned long)LL_Buffer_len(&nn_out_info[i]);
      printf("[NN] out[%d] %-24s len=%lu bytes (%lu floats)\r\n",
             i, nm, blen, blen / (unsigned long)sizeof(float));
    }
  }

  void *pp_input[NN_OUT_NB];
  uint32_t pp_len[NN_OUT_NB];
  od_pp_out_t pp_output;
  uint32_t nn_pp[2];
  int ret;

#if POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
  app_postprocess_init(NULL);
#else
  app_postprocess_init(&pp_params);
#endif

  /* -------- FaceRec I/O discovery (INT8 pipeline) -------- */
  const LL_Buffer_InfoTypeDef *fr_in_info  = LL_ATON_Input_Buffers_Info_face_recognition();
  const LL_Buffer_InfoTypeDef *fr_out_info = LL_ATON_Output_Buffers_Info_face_recognition();

#if FR_INPUT_IS_U8
  uint8_t *fr_in = (uint8_t *)LL_Buffer_addr_start(&fr_in_info[0]);    /* U8 input */
  const char *mode_str = "U8(zp=128)";
#else
  int8_t  *fr_in = (int8_t  *)LL_Buffer_addr_start(&fr_in_info[0]);    /* I8 input */
  const char *mode_str = "I8(zp=0)";
#endif
  int8_t  *fr_out       = (int8_t  *)LL_Buffer_addr_start(&fr_out_info[0]); /* I8 output */
  uint32_t fr_in_len    = LL_Buffer_len(&fr_in_info[0]);
  uint32_t fr_out_len   = LL_Buffer_len(&fr_out_info[0]);

  const uint32_t need_in_bytes = (uint32_t)(FR_IN_W * FR_IN_H * 3);  /* e.g., 160*160*3 = 76800 */

  if (!fr_in || !fr_out || fr_in_len < need_in_bytes || fr_out_len < FR_EMB_SIZE) {
    printf("[FR][ERR] IO invalid: in=%p (%lu) out=%p (%lu) need_in=%lu need_out=%u\r\n",
           (void*)fr_in, (unsigned long)fr_in_len,
           (void*)fr_out, (unsigned long)fr_out_len,
           (unsigned long)need_in_bytes, (unsigned)FR_EMB_SIZE);
  } else {
    printf("[FR][IO] IN=%p (%lu) OUT=%p (%lu)  (expected in=%lu out=%u)  [mode=%s]\r\n",
           (void*)fr_in, (unsigned long)fr_in_len,
           (void*)fr_out, (unsigned long)fr_out_len,
           (unsigned long)need_in_bytes, (unsigned)FR_EMB_SIZE, mode_str);
  }

  /* Audit reference set once */
#if DBG_AUDIT_REFSET
  {
    printf("[REFSET] entries=%d\r\n", g_ref_set_count);
    int bad=0;
    for (int i=0;i<g_ref_set_count;i++){
      float n = l2_norm(g_ref_set[i].data, g_ref_set[i].dim);
      printf("  - #%d name=%s dim=%d L2=%.3f\r\n", i,
             (g_ref_set[i].name?g_ref_set[i].name:"?"),
             g_ref_set[i].dim, n);
      if (!(n>0.0f && isfinite(n))) bad++;
    }
    if (bad) printf("[REFSET][WARN] %d invalid L2 norms (zero/NaN/Inf)\r\n", bad);
  }
#endif

  /* Detector float input (NHWC [0..1]) for cropping */
  const LL_Buffer_InfoTypeDef *det_in_info = Detector_In_Info();
  const float *det_in = (const float*)LL_Buffer_addr_start(&det_in_info[0]);
  const uint32_t det_in_len = LL_Buffer_len(&det_in_info[0]);
  (void)det_in_len; /* expected NN_WIDTH*NN_HEIGHT*3*sizeof(float) */

  /* Simple stabilizer for a single primary box */
  typedef struct {
    od_pp_outBuffer_t roi;
    int   have;
    int   visible_count;
    int   missing_count;
    uint32_t last_seen_ms;
  } primary_t;
  static primary_t primary = {0};

  /* selection/stabilization knobs (local consts for clarity) */
  const float     ACCEPT_CONF_MIN  = FR_ACCEPT_CONF_MIN;
  const float     ACCEPT_SIDE_MIN  = FR_ACCEPT_SIDE_MIN;
  const float     CENTER_TOL       = FR_CENTER_TOL;
  const float     SCORE_SIDE_REF   = FR_SCORE_SIDE_REF;
  const float     STABLE_IOU_MIN   = FR_STABLE_IOU_MIN;
  const int       HOLD_MISS_FRAMES = FR_HOLD_MISS_FRAMES;
  const float     EMA_ALPHA        = FR_EMA_ALPHA;

