muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Pipeline_FaceRecognition/facerecognition_imp.c
  /* FR throttling & threshold */
  uint32_t last_fr_ms = 0;
  const uint32_t FR_PERIOD = FR_PERIOD_MS;
  const float    MATCH_THR = FR_MATCH_THR;

  /* Debug cadence */
  uint32_t last_dbg_ms = 0;

  /* Previous embedding for self-consistency */
  float prev_emb[FR_EMB_SIZE]; int have_prev = 0;

  while (1)
  {
    (void)bqueue_get_ready(&nn_output_queue);

    /* Map & invalidate NPU outputs for CPU read */
    for (int i = 0; i < NN_OUT_NB; i++) {
      pp_input[i] = LL_Buffer_addr_start(&nn_out_info[i]);
      pp_len[i]   = LL_Buffer_len(&nn_out_info[i]);
      DCACHE_Invalidate(pp_input[i], pp_len[i]);
    }

    /* Run detection postprocess */
    pp_output.pOutBuff  = NULL;
    pp_output.nb_detect = 0;
    nn_pp[0] = HAL_GetTick();
#if POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
    ret = app_postprocess_run((void **)pp_input, NN_OUT_NB, &pp_output, NULL);
#else
    ret = app_postprocess_run((void **)pp_input, NN_OUT_NB, &pp_output, &pp_params);
#endif
    assert(ret == 0);
    nn_pp[1] = HAL_GetTick();

    uint32_t now = nn_pp[1];

    /* -------- choose ONE best detection & stabilize -------- */
    od_pp_outBuffer_t best;
    int have_best = 0;
    if (pp_output.nb_detect > 0) {
      float best_score = -1.f;
      int best_i = -1;
      for (uint32_t i = 0; i < pp_output.nb_detect; ++i) {
        const od_pp_outBuffer_t *d = &pp_output.pOutBuff[i];
        float side = fmaxf(d->width, d->height);
        if (d->conf < ACCEPT_CONF_MIN || side < ACCEPT_SIDE_MIN) continue;

        float dx = fabsf(d->x_center - 0.5f);
        float dy = fabsf(d->y_center - 0.5f);
        float r_center = sqrtf(dx*dx + dy*dy);
        float s_size   = fminf(1.f, side / SCORE_SIDE_REF);
        float s_center = 1.f - fminf(1.f, r_center / CENTER_TOL);
        float score = d->conf * (0.25f + 0.75f * s_size) * s_center;

        if (score > best_score) { best_score = score; best = *d; have_best = 1; best_i = (int)i; }
      }
      if (have_best) {
#if DBG_PRINT_ROI
        float side = fmaxf(best.width, best.height);
        float dx = fabsf(best.x_center - 0.5f);
        float dy = fabsf(best.y_center - 0.5f);
        float r_center = sqrtf(dx*dx + dy*dy);
        printf("[PP] best_det idx=%d conf=%.2f side=%.3f r_center=%.3f\r\n", best_i, best.conf, side, r_center);
#endif
      }
    }

    if (have_best) {
      if (!primary.have) {
        primary.roi = best;
        primary.have = 1;
        primary.visible_count = 1;
        primary.missing_count = 0;
        primary.last_seen_ms  = now;
      } else {
        /* IoU vs previous → smooth if “same” */
        float ov = iou_norm_boxes(&primary.roi, &best);
        if (ov >= STABLE_IOU_MIN) {
          primary.roi.x_center = EMA_ALPHA*primary.roi.x_center + (1.f-EMA_ALPHA)*best.x_center;
          primary.roi.y_center = EMA_ALPHA*primary.roi.y_center + (1.f-EMA_ALPHA)*best.y_center;
          primary.roi.width    = EMA_ALPHA*primary.roi.width    + (1.f-EMA_ALPHA)*best.width;
          primary.roi.height   = EMA_ALPHA*primary.roi.height   + (1.f-EMA_ALPHA)*best.height;
          primary.roi.conf     = best.conf;
          primary.roi.class_index = best.class_index;
          primary.visible_count++;
          primary.missing_count = 0;
          primary.last_seen_ms  = now;
        } else {
          if (primary.missing_count >= HOLD_MISS_FRAMES) {
            primary.roi = best;
            primary.visible_count = 1;
            primary.missing_count = 0;
            primary.last_seen_ms  = now;
          } else {
            primary.missing_count++;
          }
        }
      }
    } else {
      if (primary.have) {
        primary.missing_count++;
        if (primary.missing_count > HOLD_MISS_FRAMES) {
          memset(&primary, 0, sizeof(primary));
          g_fr_overlay_label[0] = '\0';  /* clear overlay */
        }
      }
    }

    /* ---------- FaceRec match (throttled) ---------- */
    if (primary.have && det_in && fr_in && fr_out && (now - last_fr_ms >= FR_PERIOD)) {
      last_fr_ms = now;

      CropDbg cdbg;
      /* Prepare FR input: detector float [0..1] -> FR quant (I8 or U8) with margin */
      crop_to_facerec_input_quant_from_detector_f32(
        det_in, NN_WIDTH, NN_HEIGHT,
        &primary.roi,
        FR_CROP_MARGIN,
        fr_in, FR_IN_W, FR_IN_H,
        &cdbg);

      /* Cache: CPU -> NPU */
      DCACHE_Clean(fr_in, need_in_bytes);

      /* Optional periodic debug on crop + input stats */
      if ((now - last_dbg_ms) >= DBG_EVERY_MS) {
#if DBG_PRINT_ROI
        printf("[FR][crop] px=[%.1f,%.1f]-[%.1f,%.1f] side=%.1f roiWH=%.1fx%.1f "
               "clamped=%d/%d (%.1f%%) preQ_meanRGB=%.3f/%.3f/%.3f\r\n",
               cdbg.x0, cdbg.y0, cdbg.x1, cdbg.y1, cdbg.side,
               cdbg.roi_w, cdbg.roi_h,
               cdbg.taps_clamped, cdbg.taps,
               (cdbg.taps>0)?(100.f*(float)cdbg.taps_clamped/(float)cdbg.taps):0.f,
               cdbg.mean_r, cdbg.mean_g, cdbg.mean_b);
#endif
#if DBG_PRINT_IN_STATS
        /* Quick stats on quantized FR input to sanity-check quantization mode */
        const int cnt = FR_IN_W * FR_IN_H * 3;
#if FR_INPUT_IS_U8
        uint8_t mn = 255, mx = 0; long sum = 0;
        double sumR=0, sumG=0, sumB=0;
        for (int i=0;i<cnt;i+=3){
          uint8_t r=((uint8_t*)fr_in)[i+0], g=((uint8_t*)fr_in)[i+1], b=((uint8_t*)fr_in)[i+2];
          if(r<mn)mn=r; if(r>mx)mx=r; sum+=r; sumR+=r; sumG+=g; sumB+=b;
          if(g<mn)mn=g; if(g>mx)mx=g; sum+=g;
          if(b<mn)mn=b; if(b>mx)mx=b; sum+=b;
        }
        float mean = (float)sum / (float)cnt;
        float mr=(float)(sumR/(double)(cnt/3)), mg=(float)(sumG/(double)(cnt/3)), mb=(float)(sumB/(double)(cnt/3));
        printf("[FR][in] U8 stats: min=%u max=%u mean=%.1f  perC=%.1f/%.1f/%.1f (expect ~128 center)\r\n",
               (unsigned)mn, (unsigned)mx, mean, mr, mg, mb);
        if (mean < 80.f || mean > 175.f) {
          printf("[FR][SUSPECT] Input looks NOT centered at 128. If your FR tflite expects U8, ok; "
                 "if it expects I8, rebuild with -DFR_INPUT_IS_U8=0.\r\n");
        }
#else
        int8_t mn = 127, mx = -128; long sum = 0;
        double sumR=0, sumG=0, sumB=0;
        for (int i=0;i<cnt;i+=3){
          int8_t r=((int8_t*)fr_in)[i+0], g=((int8_t*)fr_in)[i+1], b=((int8_t*)fr_in)[i+2];
          if(r<mn)mn=r; if(r>mx)mx=r; sum+=r; sumR+=r; sumG+=g; sumB+=b;
          if(g<mn)mn=g; if(g>mx)mx=g; sum+=g;
          if(b<mn)mn=b; if(b>mx)mx=b; sum+=b;
        }
        float mean = (float)sum / (float)cnt;
        float mr=(float)(sumR/(double)(cnt/3)), mg=(float)(sumG/(double)(cnt/3)), mb=(float)(sumB/(double)(cnt/3));
        printf("[FR][in] I8 stats: min=%d max=%d mean=%.1f  perC=%.1f/%.1f/%.1f (expect ~0 center)\r\n",
               (int)mn, (int)mx, mean, mr, mg, mb);
        if (mean < -40.f || mean > 40.f) {
          printf("[FR][SUSPECT] Input looks far from 0. Your FR likely expects U8 (zp=128). "
                 "Rebuild with: -DFR_INPUT_IS_U8=1\r\n");
        }
#endif /* FR_INPUT_IS_U8 */
#endif /* DBG_PRINT_IN_STATS */
        last_dbg_ms = now;
      }

      /* Run FaceRec (serialized on NPU) */
      NPU_Lock(TAG_FR);
      uint32_t t0 = HAL_GetTick();
      FaceRec_Run_NoLock();
      uint32_t dt = HAL_GetTick() - t0;
      NPU_Unlock(TAG_FR);

      /* Cache: NPU -> CPU */
      DCACHE_Invalidate(fr_out, fr_out_len);

      /* Dequantize int8 embeddings → float; scale=1/128, zp=0 */
      float probe_f[FR_EMB_SIZE];
      const int probe_dim = (int)MIN(FR_EMB_SIZE, (int)(fr_out_len)); /* e.g., 512 bytes */
      int out_min = 127, out_max = -128; long out_sum = 0;
      for (int i = 0; i < probe_dim; ++i) {
        int8_t q = fr_out[i];
        if (q < out_min) out_min = q;
        if (q > out_max) out_max = q;
        out_sum += q;
        probe_f[i] = (float)q * 0.0078125f;  /* 1/128 */
      }
      /* Debug: dump first 10 embedding floats */
      for (int i = 0; i < 10 && i < probe_dim; i++) {
          printf("[FR][vec] probe[%d] = %.4f\r\n", i, probe_f[i]);
      }

